app/controllers/applicants_controller.rb

  def create
    @applicant = Applicant.new(applicant_params.merge(workflow_state: 'applied'))

    if @applicant.save
---
INSERT INTO "applicants" ("first_name", "last_name", "email", "phone", "phone_type", "region", "workflow_state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @applicant = Applicant.find_by(id: params[:id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT 1  [["id", 951432]]

  def show
    @applicant = Applicant.find_by(id: params[:id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT 1  [["id", 951431]]