app/controllers/funnels_controller.rb

SELECT "applicants".* FROM "applicants" WHERE ("applicants"."created_at" BETWEEN '2014-12-25' AND '2015-01-01')
SELECT COUNT(*) FROM "applicants" WHERE ("applicants"."created_at" BETWEEN NULL AND NULL) AND "applicants"."workflow_state" = ?  [["workflow_state", "quiz_started"]]
---
  def index
    start_date = Date.parse(params[:start_date])
    end_date = Date.parse(params[:end_date])

    @funnel = {}

    until start_date >= end_date

      range = start_date..(start_date + 1.week)

      applicants = Applicant.where(:created_at => start_date..(start_date + 1.week))

      @funnel[range.to_s] = {
        "applied": applicants.size,
        "quiz_started": applicants.where(workflow_state: 'quiz_started').size,
        "quiz_completed": applicants.where(workflow_state: 'quiz_completed').size,
        "onboarding_requested": applicants.where(workflow_state: 'onboarding_requested').size,
        "onboarding_completed": applicants.where(workflow_state: 'onboarding_completed').size,
        "hired": applicants.where(workflow_state: 'hired').size,
        "rejected": applicants.where(workflow_state: 'rejected').size