app/controllers/sessions_controller.rb

SELECT  "applicants".* FROM "applicants" WHERE "applicants"."email" = ? LIMIT 1  [["email", "karl.gleason@example.com"]]
---
  def create
    @applicant = Applicant.find_by(email: params[:email])